


class_names = {
    1: 'Ель',       # Класс 1 - Ель
    2: 'Пихта',     # Класс 2 - Пихта
    3: 'Береза',    # Класс 3 - Береза
    4: 'Осина',     # Класс 4 - Осина
    5: 'Липа',      # Класс 5 - Липа
    0: 'Мертвое дерево'  # Класс 0 - Мертвое дерево
}

# Словарь с маппингом классов в коды пород
class_codes = {
    1: 2,  # Класс 1 - Код 2 (Ель)
    2: 3,  # Класс 2 - Код 3 (Пихта)
    3: 5,  # Класс 3 - Код 5 (Береза)
    4: 6,  # Класс 4 - Код 6 (Осина)
    5: 7,  # Класс 5 - Код 7 (Липа)
    0: 0   # Класс 0 - Код 0 (Мертвое дерево)
}